InformationRegisters/СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеРеквизитовНаРусскомИГосударственномЯзыках</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаРусскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаГосЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаименованиеОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазваниеНаселенногоПункта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СоответствиеРеквизитовНаРусскомИГосударственномЯзыках/Forms/ФормаРедактированияЗаписейВИстории/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОрганизацияСсылка = ?(ЭтотОбъект.Параметры.Свойство("ОрганизацияСсылка"), ЭтотОбъект.Параметры.ОрганизацияСсылка, Справочники.Организации.ПустаяСсылка());
	ДатаЗаписи = ?(ЭтотОбъект.Параметры.Свойство("Дата"), ЭтотОбъект.Параметры.Дата, НачалоГода(ТекущаяДата()));
	
	Если НЕ ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		Если ЭтотОбъект.Параметры.Свойство("ЗначенияЗаполнения") Тогда
			ЭтотОбъект.Параметры.ЗначенияЗаполнения.Свойство("Организация", ОрганизацияСсылка);
		ИначеЕсли ЭтотОбъект.Параметры.Свойство("Ключ") Тогда
			ОрганизацияСсылка = ЭтотОбъект.Параметры.Ключ.Организация;
		КонецЕсли;
	КонецЕсли;
	
	// Подготовка группы Предпросмотр - заполнение стандартными параметрами
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(РегистрыСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.ПолучитьМакет("ШаблонФормыВвода"));
	УстановитьУсловноеОформление();
	
	ЗаполнитьДанныеИзРегистра();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИзРегистра()
	
	ДанныеОрганизации = Новый Структура("ДатаСреза, Организация", ДатаЗаписи, ОрганизацияСсылка);
	
	ДанныеСоответствий = ФормированиеПечатныхФормПоПравиламВеденияДО.ПолучитьАктуальныеДанныеСоответствийРеквизитовПечати(ДанныеОрганизации);
	
	Если ЗначениеЗаполнено(ДанныеСоответствий) Тогда
		
		ДатаНачалаДействия = ?(ЗначениеЗаполнено(ДанныеСоответствий.ДатаНачалаДействия), ДанныеСоответствий.ДатаНачалаДействия, НачалоГода(ТекущаяДата()));		
		
		// Заполняем поля формы актуальными значениями из регистра.
		НаименованиеОрганизацииГос = ДанныеСоответствий.НаименованиеОрганизации_Гос;
		НаименованиеОрганизацииРус = ДанныеСоответствий.НаименованиеОрганизации_Рус;
		
		ФормаСобственностиГос  	   = ДанныеСоответствий.ФормаСобственности_Гос;
		ФормаСобственностиРус      = ДанныеСоответствий.ФормаСобственности_Рус;
		
		МестоРегистрацииГос        = ДанныеСоответствий.МестоИздания_Гос;
		МестоРегистрацииРус        = ДанныеСоответствий.МестоИздания_Рус;
		
		// Заполняем макет-образец полученными значениями, если они есть. Если нет - оставляем стандартные значения
		ЗаполнитьТабличныйДокумент();
						
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Наименование_НеЗаполнено 	   = Ложь;
	ФормаСобственности_НеЗаполнено = Ложь;
	МестоИздания_НеЗаполнено 	   = Ложь;
	
	Если Не Модифицированность Тогда
		
		Закрыть();
		
	Иначе	
		
		// Проверяем заполненность обязательных реквизитов
		Если ПроверитьЗаполнениеСервер() Тогда
			
			// Проверяем заполненность строк реквизитов
			Если Не ЗначениеЗаполнено(НаименованиеОрганизацииГос) Или Не ЗначениеЗаполнено(НаименованиеОрганизацииРус) Тогда
				
				Наименование_НеЗаполнено = Истина;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ФормаСобственностиГос) Или Не ЗначениеЗаполнено(ФормаСобственностиРус) Тогда
				
				ФормаСобственности_НеЗаполнено = Истина;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(МестоРегистрацииГос) Или Не ЗначениеЗаполнено(МестоРегистрацииРус) Тогда
				
				МестоИздания_НеЗаполнено = Истина;
				
			КонецЕсли;
			
			// Если есть пустые строки - необходимо предупредить пользователя
			Если Наименование_НеЗаполнено Или ФормаСобственности_НеЗаполнено Или МестоИздания_НеЗаполнено Тогда
				
				СообщитьПользователюОПустыхЗначенияхНаКлиенте();
				
			Иначе
				
				ЗаписатьНовыеДанныеВРегистр();
				
				Если Не Модифицированность Тогда 
					Закрыть();
					Оповестить();
				КонецЕсли;					
				
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляВводаРеквизита(Команда)
	
	Модифицированность = Истина;
	
	ЗаполнитьТабличныйДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Заполняем "подсказки" в полях
	СтандартныеНаименования = ФормированиеПечатныхФормПоПравиламВеденияДО.ПолучитьСтандартныеНаименованияДляМакета();
	
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение = """" + СтандартныеНаименования.НаименованиеОрганизации_Гос + """";
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение = """" + СтандартныеНаименования.НаименованиеОрганизации_Рус + """";
	ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение 	 = СтандартныеНаименования.ФормаСобственности_Гос;
	ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение	  	 = СтандартныеНаименования.ФормаСобственности_Рус;
	ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение 			 = СтандартныеНаименования.МестоИздания_Гос;
	ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение   		 = СтандартныеНаименования.МестоИздания_Рус;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокумент()
	
	УстановитьУсловноеОформление();
	
	Если ЗначениеЗаполнено(НаименованиеОрганизацииГос) Тогда
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение = """" + НаименованиеОрганизацииГос + """";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеОрганизацииРус) Тогда
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение = """" + НаименованиеОрганизацииРус + """";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаСобственностиГос) Тогда
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение 	 = ФормаСобственностиГос;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаСобственностиРус) Тогда
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение	  	 = ФормаСобственностиРус;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МестоРегистрацииГос) Тогда
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение 			 = МестоРегистрацииГос;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МестоРегистрацииРус) Тогда
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение 			 = МестоРегистрацииРус;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователюОПустыхЗначенияхНаКлиенте()
	
	Оповещение = Новый ОписаниеОповещения("СообщитьПользователюОПустыхЗначенияхНаКлиентеЗавершение", ЭтотОбъект);	
	
	ТекстВопроса = НСтр("ru = 'В форме остались пустые поля, при печати шапка документов будет заполняться не полностью.  
	|Продолжить и записать пустые значения реквизитов?'");
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		НСтр("ru = 'Да'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки,  , КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователюОПустыхЗначенияхНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьНовыеДанныеВРегистр();
		
		Если Не Модифицированность Тогда
			
			Закрыть();
			Оповестить();
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовыеДанныеВРегистр()
	
	НачатьТранзакцию();
	
	Попытка
		
		ДанныеОрганизации = Новый Структура("ДатаСреза, Организация", ДатаЗаписи, ОрганизацияСсылка);
		
		СтарыеДанныеРегистра = ФормированиеПечатныхФормПоПравиламВеденияДО.ПолучитьАктуальныеДанныеСоответствийРеквизитовПечати(ДанныеОрганизации);
						
		Если Модифицированность Тогда
			
			// Если изменились какие-то данные, формируем 3 записи в регистр
			НаборДанныхДляЗаписи  = Новый Структура();
			НаборДанныхДляЗаписи.Вставить("Организация", 	 ОрганизацияСсылка);
			НаборДанныхДляЗаписи.Вставить("Дата", 			 ДатаНачалаДействия);
			НаборДанныхДляЗаписи.Вставить("Реквизит", 		 Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации);
			НаборДанныхДляЗаписи.Вставить("НаименованиеГос", НаименованиеОрганизацииГос);
			НаборДанныхДляЗаписи.Вставить("НаименованиеРус", НаименованиеОрганизацииРус);
			ФормированиеПечатныхФормПоПравиламВеденияДО.ЗаписатьДанныеВРегистр(НаборДанныхДляЗаписи);
			
			НаборДанныхДляЗаписи  = Новый Структура();
			НаборДанныхДляЗаписи.Вставить("Организация", 	 ОрганизацияСсылка);
			НаборДанныхДляЗаписи.Вставить("Дата", 			 ДатаНачалаДействия);
			НаборДанныхДляЗаписи.Вставить("Реквизит", 		 Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности);
			НаборДанныхДляЗаписи.Вставить("НаименованиеГос", ФормаСобственностиГос);
			НаборДанныхДляЗаписи.Вставить("НаименованиеРус", ФормаСобственностиРус);
			ФормированиеПечатныхФормПоПравиламВеденияДО.ЗаписатьДанныеВРегистр(НаборДанныхДляЗаписи);
			
			НаборДанныхДляЗаписи  = Новый Структура();
			НаборДанныхДляЗаписи.Вставить("Организация", 	 ОрганизацияСсылка);
			НаборДанныхДляЗаписи.Вставить("Дата", 			 ДатаНачалаДействия);
			НаборДанныхДляЗаписи.Вставить("Реквизит", 		 Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта);
			НаборДанныхДляЗаписи.Вставить("НаименованиеГос", МестоРегистрацииГос);
			НаборДанныхДляЗаписи.Вставить("НаименованиеРус", МестоРегистрацииРус);
			ФормированиеПечатныхФормПоПравиламВеденияДО.ЗаписатьДанныеВРегистр(НаборДанныхДляЗаписи);
			
			ЗафиксироватьТранзакцию();
			
			Модифицированность = Ложь;			
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение НСтр("ru = 'В процессе записи данных в регистр сведений возникли ошибки.'") + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеСервер()
	Возврат ПроверитьЗаполнение();
КонецФункции

#КонецОбласти
